Repository: vmordan/klever
Catalog: bridge/locale/*/LC_MESSAGES/django.po
Languages: ru

source: Please keep the file size under {0} (the current file size is {1})
ru: Пожалуйста, не загружайте файлы размером больше {0} (текущий размер файла - {1})

source: Raw
ru: Без обработки

source: Human-readable
ru: Удобочитаемый

source: You don't have an access to this page
ru: У Вас нет прав на данную страницу

source: Can't populate without Manager and service user
ru: Наполнение базы данных невозможно без Руководителя и служебного пользователя

source: You don't have an access to this job
ru: У Вас нет прав на данное задание

source: You don't have an access to one of the selected jobs
ru: У Вас нет прав для одного из отмеченных заданий

source: The job was not found
ru: Задание не было найдено

source: One of the selected jobs was not found
ru: Одно из отмеченных заданий не было найдено

source: The report was not found
ru: Отчет не был найден

source: Couldn't visualize the error trace
ru: Не удалось визуализировать трассу ошибки

source: The comparison cache was not found or was corrupted
ru: Кэш сравнения не был найден или был поврежден

source: You don't have an access to compare these jobs
ru: У Вас нет прав сравнивать данные задания

source: The problem was not found
ru: Проблема не была найдена

source: The tag was not found
ru: Тег не был найден

source: The mark was not found
ru: Оценка не была найдена

source: You don't have an access to create new marks
ru: У Вас нет прав создавать новые оценки

source: You don't have an access to delete this mark
ru: У Вас нет прав удалить данную оценку

source: No access
ru: Нет доступа

source: Producer
ru: Постановщик

source: Manager
ru: Руководитель

source: Expert
ru: Эксперт

source: Service user
ru: Служебный пользователь

source: Verification of Linux kernel modules
ru: Верификация модулей ядра Linux

source: Validation on Linux kernel modules
ru: Валидация на модулях ядра Linux

source: Verification of commits in Linux kernel Git repositories
ru: Верификация коммитов в Git-репозиториях ядра Linux

source: Validation on commits in Linux kernel Git repositories
ru: Валидация на коммитах в Git-репозиториях ядра Linux

source: Verification of C programs
ru: Верификация Си-программ

source: Validation on C programs
ru: Валидация на Си-программах

source: Total safe
ru: Доказана корректность

source: Found all unsafes
ru: Найдены все предупрeждения об ошибках

source: Found not all unsafes
ru: Найдены не все предупрeждения об ошибках

source: Unknown
ru: Неизвестно

source: Unmatched
ru: Нет соответствия

source: Observer
ru: Обозреватель

source: Observer and Operator
ru: Обозреватель и оператор

source: Expert and Operator
ru: Эксперт и оператор

source: Not solved
ru: Не решено

source: Pending
ru: Ожидает

source: Is solving
ru: Решается

source: Solved
ru: Решено

source: Failed
ru: Провалено

source: Corrupted
ru: Повреждено

source: Cancelled
ru: Отменено

source: Created
ru: Созданная

source: Preset
ru: Предустановленная

source: Uploaded
ru: Загруженная на сервер

source: Unreported
ru: Не сообщена

source: Reported
ru: Сообщена

source: Fixed
ru: Исправлена

source: Rejected
ru: Отклонена

source: Bug
ru: Ошибка

source: Target bug
ru: Целевая ошибка

source: False positive
ru: Ложное сообщение об ошибке

source: Incorrect proof
ru: Некорректное доказательство

source: Missed target bug
ru: Пропуск целевой ошибки

source: Incompatible marks
ru: Несовместимые оценки

source: Without marks
ru: Нет оценок

source: Healthy
ru: Здоровый

source: Ailing
ru: Нездоровый

source: Disconnected
ru: Отключенный

source: Urgent
ru: Срочный

source: High
ru: Высокий

source: Low
ru: Низкий

source: Idle
ru: Незанятый

source: User occupied
ru: Занятый пользователем

source: Processing
ru: Решается

source: Error
ru: Ошибка

source: Balance
ru: Баланс

source: Requirements
ru: Требования

source: Program fragments
ru: Фрагменты программ

source: Sequentially
ru: Последовательно

source: Slowly
ru: Медленно

source: Quickly
ru: Быстро

source: Very quickly
ru: Очень быстро

source: Briefly
ru: Кратко

source: In detail
ru: Детально

source: Paranoidly
ru: Параноидально

source: Production
ru: Производство

source: Development
ru: Разработка

source: Paranoid development
ru: Параноидальная разработка

source: Unknown error
ru: Неизвестная ошибка

source: The job archive is corrupted
ru: Архив задания поврежден

source: The job format is not supported
ru: Формат задания не поддерживается

source: The job class does not equal to the parent class
ru: Класс задания не совпадает с классом родителя

source: The job status is wrong
ru: Статус задания некорректный

source: One of the reports was not uploaded
ru: Один из отчетов не был загружен на сервер

source: Title
ru: Название

source: Author
ru: Автор

source: Last name
ru: Фамилия

source: Date
ru: Дата

source: Decision status
ru: Статус решения

source: Start date
ru: Дата начала работы

source: Finish date
ru: Дата завершения работы

source: Last change date
ru: Дата последнего изменения

source: Consumed resources
ru: Потребленные ресурсы

source: Component name
ru: Название компонента

source: Unknowns
ru: Проблемы в компонентах

source: Problem name
ru: Название проблемы

source: Format
ru: Формат

source: Priority
ru: Приоритет

source: Total
ru: Всего

source: Jobs
ru: Задания

source: Job files comparison
ru: Сравнение файлов заданий

source: Comparison of files of jobs
ru: Сравнение файлов заданий

source: Job reports comparison
ru: Сравнение отчетов заданий

source: Files without differences
ru: Файлы без отличий

source: Files with differences
ru: Файлы с отличиями

source: Unmatched files
ru: Несоответствующие файлы

source: Jobs do not have files
ru: У заданий нет файлов

source: Job Copying
ru: Копирование задания

source: You can choose one of the previous versions
ru: Вы можете выбрать оду из предыдущих версий

source: or change the job
ru: или изменить задание

source: Parent identifier
ru: Идентификатор родителя

source: Description
ru: Описание

source: Role for all users
ru: Роль для всех пользователей

source: Add role to user
ru: Добавить роль для пользователя

source: Add
ru: Добавить

source: Change comment
ru: Комментарий к изменению

source: Comment
ru: Комментарий

source: Save
ru: Сохранить

source: Cancel
ru: Отменить

source: Change comment is required
ru: Требуется написать комментарий к изменению

source: Title is required
ru: Требуется указать название

source: New folder
ru: Новая папка

source: New file
ru: Новый файл

source: Rename
ru: Переименовать

source: Move file
ru: Переместить файл

source: Replace file
ru: Заменить файл

source: Delete
ru: Удалить

source: Files
ru: Файлы

source: Folder name
ru: Название папки

source: Subfolder of
ru: Подпапка

source: Root
ru: Корневая папка

source: Create
ru: Создать

source: New name
ru: Новое название

source: Move
ru: Переместить

source: to
ru: в

source: will be deleted. Do you want to continue?
ru: будет удален(а). Вы хотите продолжить?

source: Browse
ru: Выбрать файл

source: Name
ru: Название

source: Upload to folder
ru: Загрузить в папку

source: Replace
ru: Заменить

source: Name is required
ru: Требуется указать название

source: One of the files was not uploaded
ru: Один из файлов не был загружен на сервер

source: The folder can't be replaced with the file
ru: Папка не может быть заменена на файл

source: Choose the file you want to replace
ru: Укажите файл, который Вы хотите заменить

source: You can't move folders, please choose the file you want to move
ru: Вы не можете переместить папки, пожалуйста, укажите файл, который Вы хотите переместить

source: Please choose the file you want to move
ru: Пожалуйста, укажите файл, который Вы хотите переместить

source: Please choose the file
ru: Пожалуйста, выберете файл

source: Please choose the file or the folder you want to rename
ru: Пожалуйста, укажите файл или папку, которую Вы хотите переименовать

source: Please choose the file or the folder you want to delete
ru: Пожалуйста, укажите файл или папку, которую Вы хотите удалить

source: Names with non-ASCII characters must be less than 30 characters
ru: Названия, в которых используются не ASCII символы, должны быть меньше 30 символов

source: Unsafes
ru: Предупреждения об ошибках

source: Safes
ru: Доказательства корректности

source: Wall time, CPU time and maximum memory size
ru: Астрономическое время, процессорное время и максимальный объем оперативной памяти

source: Tags
ru: Теги

source: Unsafe
ru: Предупреждение об ошибке

source: Safe
ru: Доказательство корректности

source: History of decisions
ru: История решений

source: Download configuration file
ru: Загрузить конфигурационный файл

source: Start decision of job
ru: Начать решение задания

source: Use configuration from file
ru: Использовать конфигурацию из файла

source: Scheduling
ru: Планирование

source: Job priority
ru: Приоритет задания

source: Tasks scheduler
ru: Планировщик задач

source: Abstract tasks generation priority
ru: Приоритет генерации абстрактных задач

source: Operations parallelism
ru: Параллелизм операций

source: Build
ru: Сборка

source: Tasks generation
ru: Генерация задач

source: Resource limits for Klever Core
ru: Ограничения на ресурсы для Klever Core

source: Memory size
ru: Объем оперативной памяти

source: GB
ru: ГБ

source: For instance,
ru: Например,

source: Number of CPU cores
ru: Количество ядер процессора

source: Disk memory size
ru: Объем дисковой памяти

source: CPU model
ru: Модель процессора

source: You can specify any substring of the target CPU model. The empty value means any model.
ru: Вы можете указать любую подстроку целевой модели процессора. Пустое значение означает любую модель.

source: Logging
ru: Логирование

source: Console
ru: Консоль

source: Logging level
ru: Уровень логирования

source: Formatter
ru: Форматер

source: File
ru: Файл

source: Other settings
ru: Другие настройки

source: Keep intermediate files inside the working directory of Klever Core
ru: Сохранять промежуточные файлы в рабочей директории Klever Core

source: Upload input files of static verifiers
ru: Загружать на сервер входные файлы инструментов статической верификации

source: Upload other intermediate files
ru: Загружать на сервер другие промежуточные файлы

source: Allow use of local source directories
ru: Разрешить использовать локальные директории с исходным кодом

source: Ignore other instances of Klever Core
ru: Игнорировать другие экземпляры Klever Core

source: Start
ru: Начать

source: VerifierCloud credentials were successfully saved (you can change them in your settings)
ru: Идентификационная информация для VerifierCloud была успешно сохранена (Вы можете изменить ее в Ваших настройках)

source: Fields with red background are required
ru: Требуется заполнить поля с красным фоном

source: Fields with red background must be numeric
ru: Поля с красным фоном должны быть числовыми

source: Jobs Tree
ru: Дерево заданий

source: Columns
ru: Столбцы

source: Selected columns
ru: Выбранные столбцы

source: Available columns
ru: Доступные столбцы

source: Add order by
ru: Добавить сортировку по

source: Filters
ru: Фильтры

source: Add filter by
ru: Добавить фильтр по

source: is
ru: совпадает с

source: starts with
ru: начинается с

source: contains
ru: содержит

source: older
ru: не ранее

source: younger
ru: не позднее

source: than
ru: чем

source: minutes
ru: минут

source: hours
ru: часов

source: days
ru: дней

source: weeks
ru: недель

source: not greater than
ru: не больше чем

source: not less than
ru: не меньше чем

source: Show
ru: Показать

source: New view name
ru: Название нового представления

source: Default
ru: По умолчанию

source: Make preferred
ru: Сделать предпочитаемым

source: Update
ru: Обновить

source: Compare reports
ru: Сравнить отчеты

source: Download selected jobs
ru: Загрузить отмеченные задания

source: Delete selected jobs
ru: Удалить отмеченные задания

source: View
ru: Представление

source: unsaved
ru: не сохранено

source: Are you sure
ru: Вы уверены

source: All versions and all data of the selected jobs will be deleted
ru: Все версии и все данные отмеченных заданий будут удалены

source: Please select jobs you want to download
ru: Пожалуйста, отметьте задание, которые Вы хотите загрузить

source: Please select jobs you want to delete
ru: Пожалуйста, отметьте задания, которые Вы хотите удалить

source: Please select jobs which reports you want to compare
ru: Пожалуйста, отметьте задания, у которых Вы хотите сравнить отчеты

source: All
ru: Всего

source: All for checked
ru: Всего для отмеченных

source: List of jobs is empty, please populate them or change the view
ru: Список заданий пустой, пожалуйста, наполните базу данных или измените представление

source: Job
ru: Задание

source: Make copy
ru: Создать копию

source: Download
ru: Сохранить

source: Start decision
ru: Начать решение

source: Start decision with default values
ru: Начать решение с настройками по умолчанию

source: Stop decision
ru: Остановить решение

source: Edit
ru: Редактировать

source: Delete versions
ru: Удалить версии

source: Class
ru: Класс

source: Identifier
ru: Идентификатор

source: Created by
ru: Создано

source: Parents
ru: Родители

source: Children
ru: Потомки

source: Last change
ru: Последнее изменение

source: All versions and all data of this job will be deleted
ru: Все версии и все данные задания будут удалены

source: All existing reports of this job will be deleted
ru: Все существующие отчеты задания будут удалены

source: Hide problems without marks
ru: Не показывать проблемы без оценок

source: Hide total
ru: Не показывать суммарное количество

source: Safe tag
ru: Тег доказательства корректности

source: Unsafe tag
ru: Тег предупреждения об ошибке

source: You won't be able to restore deleted versions
ru: Вы не сможете восстановить удаляемые версии

source: No versions to delete (you can't remove first and last versions)
ru: Нет версий, которые можно удалить (Вы не можете удалить первую и последнюю версии)

source: OK
ru: Хорошо

source: Missed target bugs
ru: Пропуски целевых ошибок

source: Bugs
ru: Реальные ошибки

source: Target bugs
ru: Целевые ошибки

source: False positives
ru: Ложные сообщения об ошибках

source: Version
ru: Версия

source: Parent
ru: Родитель

source: Your role
ru: Ваша роль

source: Decision start date
ru: Дата начала решения

source: Decision finish date
ru: Дата завершения решения

source: Decision wall time
ru: Астрономическое время решения

source: Operator
ru: Оператор

source: Pending tasks
ru: Ожидающие задачи

source: Processing tasks
ru: Решающиеся задачи

source: Finished tasks
ru: Решенные задачи

source: Error tasks
ru: Проваленные задачи

source: Cancelled tasks
ru: Отмененные задачи

source: Total tasks
ru: Всего задач

source: Progress of job decision
ru: Прогресс решения задания

source: Number of task decisions
ru: Количество решений задач

source: Saving folder failed
ru: Сохранение папки провалилось

source: The file was not uploaded
ru: Файл не был загружен на сервер

source: You can't specify an empty name
ru: Вы не можете указать пустое имя

source: You can't use the same names in one folder
ru: Вы не можете использовать одни и те же имена в одной папке

source: ms
ru: мс

source: s
ru: с

source: h
ru: ч

source: B
ru: Б

source: KB
ru: КБ

source: MB
ru: МБ

source: The job title is required
ru: Требуется название задания

source: The job author is required
ru: Требуется автор задания

source: The parent or the job class is required
ru: Требуется родитель или класс задания

source: Change author is required
ru: Требуется автор изменения

source: The comparison cache was not found
ru: Кэш сравнения не был найден

source: The Klever scheduler is ailing
ru: Планировщик Klever нездоров

source: The Klever scheduler is disconnected
ru: Планировщик Klever отключен

source: The default view was made preferred
ru: Представление, которое используется по умолчанию, было сделано предпочитаемым

source: The default view is already preferred
ru: Представление, которое используется по умолчанию, уже является предпочитаемым

source: The view was not found
ru: Представление не было найдено

source: The preferred view was successfully changed
ru: Предпочитаемое представление было успешно изменено

source: Please choose another view name
ru: Пожалуйста, выберете другое название представления

source: The view name is required
ru: Требуется указать название представления

source: You can't edit the default view
ru: Вы не можете редактировать представление, которое используется по умолчанию

source: The view was successfully saved
ru: Представление было успешно сохранено

source: You can't remove the default view
ru: Вы не можете удалить представление, которое используется по умолчанию

source: The view was successfully removed
ru: Представление было успешно удалено

source: Current version
ru: Текущая версия

source: You don't have access to delete versions
ru: У Вас нет прав удалить версии

source: Selected versions were successfully deleted
ru: Отмеченные версии были успешно удалены

source: Nothing to delete
ru: Нечего удалять

source: You don't have an access to edit this job
ru: У Вас нет прав редактировать данное задание

source: The job parent was not found
ru: Родитель задания не был найден

source: Several parents match the specified identifier, please increase the length of the parent identifier
ru: Указанному идентификатору соответствуют несколько родителей, пожалуйста, увеличьте длину идентификатора родителя

source: Parent can't be specified for root jobs
ru: Нельзя указывать родителя для корневых заданий

source: The specified parent can't be set for this job
ru: Для этого задания не может быть установлен указанный родитель

source: The parent identifier is required for this job
ru: Для этого задания требуется идентификатор родителя

source: Your version is expired, please reload the page
ru: Ваша версия устарела, пожалуйста, обновите страницу

source: You don't have an access to create new jobs
ru: У Вас нет прав создавать новые задания

source: You don't have an access to remove this job
ru: У Вас нет прав удалить данное задание

source: You don't have an access to remove one of the selected jobs
ru: У Вас нет прав удалить одно из отмеченных заданий

source: File uploading failed
ru: Загрузка файла на сервер провалилась

source: You don't have an access to download one of the selected jobs
ru: У Вас нет прав загрузить одно из отмеченных заданий

source: The parent identifier was not got
ru: Не был получен идентификатор родителя

source: The parent with the specified identifier was not found
ru: Родитель с указанным идентификатором не был найден

source: Too many jobs starts with the specified identifier
ru: Слишком много заданий начинаются с указанного идентификатора

source: The file was not found
ru: Файл не был найден

source: You don't have an access to stop decision of this job
ru: У Вас нет прав остановить решение данного задания

source: One of the selected jobs was not found, please reload page
ru: Одно из отмеченных заданий не было найдено, пожалуйста, обновите страницу

source: You can't compare the selected jobs
ru: Вы не можете сравнить отмеченные задания

source: Number of reports
ru: Количество отчетов

source: Change kind
ru: Тип изменения

source: Verdict
ru: Вердикт

source: Total verdict
ru: Итоговый вердикт

source: Similarity
ru: Похожесть

source: Status
ru: Статус

source: Report
ru: Отчет

source: Number of associated leaf reports
ru: Количество привязанных листовых отчетов

source: Problem
ru: Проблема

source: Component
ru: Компонент

source: Problem pattern
ru: Шаблон проблемы

source: Source
ru: Источник

source: Automatic association
ru: Автоматическая привязка

source: Has non-automatic association
ru: Имеется неавтоматическая привязка

source: Changed
ru: Изменена

source: New
ru: Новая

source: Deleted
ru: Удалена

source: Comparison failed
ru: Сравнение провалилось

source: No
ru: Нет

source: Yes
ru: Да

source: %(all)s (%(broken)s are broken)
ru: %(all)s (%(broken)s сломаны)

source: Create mark
ru: Создать оценку

source: Error traces conversion function
ru: Функция преобразования трасс ошибок

source: Error traces comparison function
ru: Функция сравнения трасс ошибок

source: Attributes
ru: Атрибуты

source: Editable
ru: Возможно ли редактирование

source: Pattern
ru: Шаблон

source: Link to detailed description
ru: Ссылка на детальное описание

source: The pattern is required
ru: Требуется шаблон

source: The problem is required
ru: Требуется проблема

source: Unsafes mark
ru: Оценка предупреждений об ошибках

source: Safes mark
ru: Оценка доказательств корректности

source: Associated leaf reports
ru: Привязанные листовые отчеты

source: List of associated leaf reports is empty
ru: Список привязанных листовых отчетов пустой

source: All versions and all data of this mark will be deleted
ru: Все версии и все данные оценки будут удалены

source: Unknowns mark
ru: Оценка проблем в компонентах

source: Safe marks
ru: Оценки доказательств корректности

source: Unsafe marks
ru: Оценки предупреждений об ошибках

source: Unknown marks
ru: Оценки проблем в компонентах

source: Delete selected marks
ru: Удалить отмеченные оценки

source: List of marks of the given type is empty, please create them or change the view
ru: Список оценок данного типа пустой, пожалуйста, создайте их или измените представление

source: All versions and all data of the selected marks will be deleted
ru: Все версии и все данные отмеченных оценок будут удалены

source: Please select marks you want to delete
ru: Пожалуйста, отметьте оценки, которые Вы хотите удалить

source: Changes in associations of marks with leaf reports
ru: Изменения привязки оценок к листовым отчетам

source: No changes in associations of marks with leaf reports
ru: Изменения привязки оценок к листовым отчетам отсутствуют

source: Continue editing
ru: Продолжить редактирование

source: Enter tag
ru: Введите тег

source: No tags to display
ru: Теги отсутствуют

source: The tag length must be not more than 15 characters
ru: Длина тега должна быть не более 15 символов

source: Mark
ru: Оценка

source: The number of associated leaf reports
ru: Количество привязанных листовых отчетов

source: Last change author
ru: Автор последнего изменения

source: Order
ru: Порядок

source: Order by attribute
ru: Упорядочить по атрибуту

source: Enter the full name of the attribute
ru: Введите полное название атрибута

source: e.g.
ru: например,

source: Order by the number of associated leaf reports
ru: Упорядочить по количеству привязанных листовых отчетов

source: is not
ru: не совпадает с

source: Value of attribute
ru: Значение атрибута

source: The error traces conversion function was not found
ru: Функция преобразования трасс ошибок не была найдена

source: Error trace converting failed
ru: Преобразование трассы ошибки провалилось

source: The error traces comparison function was not found
ru: Функция сравнения трасс ошибок не была найдена

source: The pattern is wrong, please refer to documentation on the standard Python library for processing reqular expressions
ru: Шаблон некорректный, пожалуйста, обратитесь к документации на стандартную библиотеку Python для работы с регулярными выражениями

source: The problem length must be less than 15 characters
ru: Длина проблемы должна быть не более 15 символов

source: Could not create a new mark since the similar mark exists already
ru: Не удалось создать новую оценку, поскольку существует похожая оценка

source: Could not change the mark since it would be similar to the existing mark
ru: Не удалось изменить оценку, поскольку она стала бы похожа на существую оценку

source: The mark format is not supported
ru: Формат оценки не поддерживается
