Repository: vmordan/klever
Catalog: bridge/locale/*/LC_MESSAGES/django.po
Languages: ru

source: specify functions, which should be considered as model even if they does not contain property checks (function names should be separated by commas)
ru: задать функции, которые будут считаться модельными, даже если они не содержат проверок требований (имена функций должны быть указаны через запятую)

source: add passed property checks descriptions
ru: добавить описания успешно пройденных проверок требований

source: add property violation descriptions
ru: добавить описания нарушений требований

source: allows to choose function <code>comparison(t<sub>1</sub>, t<sub>2</sub>)</code> from the predefined list. Each function comes with description. By default function <code>equal</code> is used.
ru: позволяет выбрать функцию <code>comparison(t<sub>1</sub>, t<sub>2</sub>)</code> из предопределённого списка. Для каждой функции дано описание. По умолчанию используется функция <code>equal</code>.

source: allows to choose <code>similarity_threshold</code> for the <code>similarity(n)</code> function. Currently the <code>similarity(n)</code> function is Jaccard index. By default value 100%% is used (error traces have the same number of threads and they are equal).
ru: позволяет задать значение порога <code>similarity_threshold</code> для функции <code>similarity(n)</code>. На данный момент в качестве функции <code>similarity(n)</code> используется мера Жаккара. По умолчанию используется значение 100%% (т. е. трассы ошибок должны состоять из одинакового числа эквивалентных потоков).

source: allows to speed up the process of marks application by applying mark only to the current report ('Apply only to current report'). Use optimizations only as a last resort, because such marks may be lost for future reports, which wastes all efforts of creating the mark.
ru: позволяет ускорить процесс применения оценки путём ограничения области применимости до текущего отчёта (опция 'Применять к трассам только из анализируемого отчёта'). Необходимо использовать оптимизации только в крайнем случае, поскольку подобные оценки могут быть потеряны для будущих отчётов, что сводит на нет все усилия по их созданию.

source: allows to change initial (%(t1)s) error trace for this mark (only on editing). This may change converted error trace (e.g., swap %(t1)s and %(t2)s in the <code>is_equivalent(%(t1)s, %(t2)s)</code> function) and thus drastically change mark application.
ru: позволяет изменить исходную (%(t1)s) трассу ошибки для данной оценки (только во время редактирования). Действие может поменять трассу ошибки после применения функции преобразования (т. е. в функции <code>is_equivalent(%(t1)s, %(t2)s)</code> аргументы %(t1)s и %(t2)s поменяются местами), а следовательно, существенно изменить применимость оценки.

source: allows to manually change error trace after applying conversion function to it (<code>manual</code> function).
ru: позволяет пользователю вручную внести изменения в трассу ошибки после применения функции преобразования (т. е. соответствует функции <code>manual</code>).

source: The general schema of extended unsafe mark creation is the following:
ru: Общая схема создания расширенной оценки трассы ошибки выглядит следующим образом:

source: Therefore, the user iteratively increases (scenario 1) or reduces (scenario 2) accuracy of the mark, until it is applied to error traces, which corresponds to the same bug.
ru: Таким образом, пользователь итеративно повышает (сценарий 1) или понижает (сценарий 2) точность оценки, пока она не будет применима только к трассам, которые соответствуют одной и той же ошибке.

source: The mark is applied to an error trace, which corresponds to other bugs
ru: Оценка применима к трассе ошибки, которая соответствует другой ошибке

source: The user finds out, which elements are missing in converted error trace, but can be used to distinguish 2 traces, then chooses more accurate conversion function or changes conversion function arguments (e.g., by adding new model functions or property checks description), until the required elements show up in the converted error trace. After saving this mark, the user must check all other error traces, for which mark was applied, in order to make sure, that none of them corresponds to the other bug. If this is not the case, the operation should be repeated, taking into account new error trace, which correspond to other bug. Note, if the mark is too accurate, it may not be applied to some traces, which correspond to the same bug (see the second scenario).
ru: Пользователь определяет, каких элементов не хватает в трассе ошибки после применения функции преобразования, но которые могли бы быть использованы для разделения двух трасс ошибок, затем выбирает более точную функцию преобразования или изменяет её аргументы (например, добавляя дополнительные модельные функции или описания проверок требований) до тех пор, пока требуемые элементы не появятся в трассе ошибки после применения функции преобразования. После сохранения оценки пользователь должен проверить все трассы ошибок, к которым оценка была применена, для того чтобы удостовериться в том, что ни одна из них не соответствует другим ошибкам. Если это не так, данная операция должна быть повторена, принимая во внимание новую трассу ошибки, которая соответствует другой ошибке. Стоит отметить, что если оценка слишком точная, то она может быть применена не ко всем трассам, которые соответствуют той же ошибке (см. сценарий 2).

source: There is a trace, which corresponds to the same bug, but the mark was not applied to it
ru: Существует трасса ошибки, соответствующая той же ошибке, но оценка не была применена к ней

source: The user finds out, which elements distinguishes 2 equivalent error traces, then chooses less accurate conversion function, changes conversion function arguments (e.g., by excluding some functions or property checks description) or removes some elements from the error trace manually until the required elements are removed from the converted error trace. In case of manual changes, the user should also change comparison function to check elements for inclusion instead of equivalence. After saving this mark, the user must check all other error traces, for which mark was applied, in order to make sure, that none of them corresponds to the other bug (see the first scenario), and there is no error trace, which correspond to the same bug and for which this mark was not applied. If this is not the case, the operation should be repeated, taking into account new error trace, which correspond to the same bug.
ru: Пользователь определяет, какие элементы разделяют две эквивалентные трассы, затем выбирает менее точную функцию преобразования, изменяет её аргументы (например, исключая из трассы некоторые функции или описания проверок требований) или удаляет требуемые элементы непосредственно из трассы ошибки вручную до тех пор, пока требуемые элементы не удалятся из трассы ошибки после применения функции преобразования. В случае ручных изменений необходимо также поменять функцию сравнения на включение элементов. После сохранения оценки пользователь должен проверить все трассы ошибок, к которым оценка была применена, для того чтобы удостовериться в том, что ни одна из них не соответствует другим ошибкам (см. сценарий 1), и не существует трасс ошибок, соответствующих той же ошибке, для которых данная оценка не была применена. Если это не так, данная операция должна быть повторена, принимая во внимание новую трассу ошибки, которая соответствует той же ошибке.

source: This web-interface displays results for continuous verification (CV) system
ru: Данный web-интерфейс отображает результаты системы непрерывной верификации CV

source: Useful links
ru: Полезные ссылки

source: CV is based on ideas of the LDV project
ru: система CV основа на идеях проекта LDV

source: CV extends Klever web-interface for the continuous verification needs
ru: система CV расширяет web-интерфейс системы верификации Klever для нужд непрерывной верификации

source: verifier engine
ru: инструмент верификации

source: Mark cannot be applied to the initial error trace
ru: Оценка не применима к исходной трассе ошибки

source: Mark cannot be applied to the selected attributes
ru: Оценка не применима к выбранным атрибутам
