Repository: vmordan/klever
Catalog: bridge/locale/*/LC_MESSAGES/django.po
Languages: ru

source: Could not upload the mark archive since the similar mark exists already
ru: Не удалось загрузить архив с оценкой, поскольку существует похожая оценка

source: The attributes have wrong format
ru: Формат атрибутов некорректный

source: The mark archive is corrupted
ru: Архив оценки поврежден

source: The mark archive is corrupted: the pattern error trace is not found
ru: Архив оценки поврежден: не найдена шаблонная трасса ошибки

source: You don't have an access to this mark
ru: У Вас нет прав на данную оценку

source: You don't have an access to edit this mark
ru: У Вас нет прав редактировать данную оценку

source: You don't have access to create new marks
ru: У Вас нет прав создавать новые оценки

source: You can't delete one of the selected mark
ru: Вы не можете удалить одну из отмеченных оценок

source: Required reports were not found
ru: Требуемые отчеты не были найдены

source: The report was not found, please recalculate the comparison cache
ru: Отчет не был найден, пожалуйста, пересчитайте кэш сравнения

source: Could not find the corresponding unsafe
ru: Не удалось найти соответствующие предупреждение об ошибке

source: Could not get the source file
ru: Не удалось получить файл с исходным кодом

source: Order by
ru: Упорядочить по

source: Attribute
ru: Атрибут

source: Only finished children will be shown
ru: Будут показаны только завершенные потомки

source: Play
ru: Играть

source: Play from the selected line
ru: Играть с выбранной строки

source: Play backward
ru: Играть назад

source: Play backward from the selected line
ru: Играть назад с выбранной строки

source: Play one line forward
ru: Играть одну строку вперед

source: Play one line backward
ru: Играть одну строку назад

source: Pause
ru: Остановить

source: second per a line
ru: секунда на строку

source: seconds per a line
ru: секунды на строку

source: Error trace assumptions are disabled (you can enable them in your settings)
ru: Предположения трассы ошибок отключены (Вы можете включить их в Ваших настройках)

source: Could not find the specified line
ru: Не удалось найти указанную строку

source: Please, select the line first
ru: Пожалуйста, сначала выберете строку

source: Play of the error trace was completed
ru: Проигрывание трассы ошибки завершено

source: Error trace
ru: Трасса ошибки

source: Leave empty for order by creation date
ru: Оставьте пустым для упорядочивания по дате создания

source: Validation results
ru: Результаты валидации

source: Before fix
ru: До исправления

source: After fix
ru: После исправления

source: Data
ru: Данные

source: In progress
ru: Выполняется

# component status
source: Finished
ru: Завершился

source: Computer
ru: Компьютер

source: Duration
ru: Продолжительность

source: Creation date
ru: Дата создания

source: Maximum memory size
ru: Максимальный объем оперативной памяти

source: Log
ru: Лог

source: Download files
ru: Загрузить файлы

source: There is no children, please wait for them or change the view
ru: Потомков нет, пожалуйста, подождите их или измените представление

source: Statistics on component and its children
ru: Статистика по компоненту и его потомкам

source: Leave empty for order by component
ru: Оставьте пустым для упорядочивания по компоненту

source: Comparison of reports of jobs
ru: Сравнение отчетов заданий

source: Show all (sub)components
ru: Показать все (под)компоненты

source: Show all attributes
ru: Показать все атрибуты

source: Search
ru: Найти

source: Please select to show all attributes
ru: Пожалуйста, выберете показ всех атрибутов

source: Error Trace Fullscreen
ru: Полноэкранная Трасса ошибки

source: Associated marks
ru: Привязанные оценки

source: Number of associated marks
ru: Количество привязанных оценок

source: All safes
ru: Все доказательства корректности

source: Safes marked by
ru: Доказательства корректности с оценкой

source: All unsafes
ru: Все предупрeждения об ошибках

source: Unsafes marked by
ru: Предупреждения об ошибках с оценкой

source: All unknowns
ru: Все проблемы в компонентах

source: Unknowns without marks
ru: Проблемы в компонентах без оценок

source: Unknowns marked by
ru: Проблемы в компонентах с оценкой

source: The component log is huge and can not be showed but you can download it
ru: Лог компонента большой и не может быть показан, но Вы можете загрузить его

source: Schedulers
ru: Планировщики

source: Scheduler
ru: Планировщик

source: Verification tools
ru: Инструменты верификации

source: Close
ru: Закрыть

source: Configurations and statistics of Klever scheduler nodes
ru: Конфигурации и статистика узвлов планировщика Klever

source: Node configurations
ru: Конфигурации узлов

source: Number of solving jobs
ru: Количество решаемых задания

source: Number of solving tasks
ru: Количество решаемых задач

source: Nodes configuration
ru: Конфигурация узлов

source: Number of nodes
ru: Количество узлов

source: Klever scheduler nodes
ru: Узлы планировщика Klever

source: Hostname
ru: Название узла

source: Available for solving tasks
ru: Доступен для решения задач

source: Available for solving jobs
ru: Доступен для решения заданий

source: Klever scheduler doesn't have nodes
ru: У планировщика Klever нет узлов

source: Reserved
ru: Зарезервировано

source: Available
ru: Доступно

source: The job solving progress does not exist
ru: Прогресс решения задания не существует

source: Only pending and processing jobs can be stopped
ru: Только ожидающие и решающиеся задания могут быть остановлены

source: The scheduler was not found
ru: Планировщик не был найден

source: You don't have an access to start decision of this job
ru: У Вас нет прав начать решение данного задания

source: The VerifierCloud scheduler is disconnected
ru: Планировщик VerifierCloud отключен

source: You didn't specify credentials for VerifierCloud
ru: Вы не указали идентификационную информацию для VerifierCloud

source: Population
ru: Наполнение базы данных

source: A new Manager was created
ru: Был создан новый Руководитель

source: Username
ru: Имя пользователя

source: Password
ru: Пароль

source: Please save this data and give it to the user who will be the Manager
ru: Пожалуйста, сохранить эти данные и передайте их пользователю, который будет Руководителем

source: A new service user was created
ru: Был создан новый служебный пользователь

source: Please save this data and give it to the service user
ru: Пожалуйста, сохранить эти данные и передайте их служебному пользователю

source: Error traces conversion and comparison functions were updated
ru: Были обновлены функции преобразования и сравнения трасс ошибок

source: New root jobs were uploaded
ru: Были загружены новые корневые задания

source: New preset jobs were uploaded
ru: Были загружены новые предустановленные задания

source: New unknown marks were uploaded
ru: Были загружены новые оценки проблем в компонентах

source: Nothing changed
ru: Ничего не изменилось

source: Welcome to Klever Bridge!
ru: Добро пожаловать!

source: Create the Manager with the specified username and jobs of all classes on behalf of that Manager
ru: Создать Руководителя с указанным именем и задания всех классов от имени данного Руководителя

source: Manager username
ru: Имя Руководителя

source: Create the service user with the specified username
ru: Создать служебного пользователя с указанным именем

source: Service username
ru: Имя служебного пользователя

source: Manager and service usernames must be different
ru: Имена Руководителя и служебного пользователя должны быть разными

source: Manager and service usernames are required
ru: Требуется заполнить имена Руководителя и служебного пользователя

source: Populate
ru: Наполнить базу данных

source: Sign in
ru: Войти

source: Please wait
ru: Пожалуйста, подождите

source: Menu
ru: Меню

source: Upload
ru: Загрузить

source: Marks
ru: Оценки

source: Admin Tools
ru: Панель администатора

source: Manager Tools
ru: Панель руководителя

source: Settings
ru: Настройки

source: Sign Out
ru: Выйти

source: Register
ru: Регистрация

source: Sign In
ru: Войти

source: Upload marks
ru: Загрузить оценки на сервер

source: Upload jobs
ru: Загрузить задания на сервер

source: Set parent identifier (keep in mind that job class will be inherited from parent). All file or folder names with non-ASCII characters will be truncated to 30 characters.
ru: Задайте идентификатор родителя (помните, что класс задания будет унаследован от родителя). Все названия файлов и папок, в которых используются не ASCII символы, будут обрезаны до 30 символов.

source: The parent identifier is required
ru: Требуется идентификатор родителя

source: No file is chosen
ru: Не выбран ни один файл

source: Components
ru: Компоненты

source: Delete all unused components
ru: Удалить все неиспользуемые компоненты

source: There are no components yet
ru: Компонентов еще нет

source: Problems
ru: Проблемы

source: Delete all unused problems
ru: Удалить все неиспользуемые проблемы

source: There are no problems yet
ru: Проблем еще нет

source: Remove unused files and DB rows
ru: Удалить неиспользуемые файлы и строки БД

source: Recalculate
ru: Пересчитать

source: All jobs
ru: Все задания

source: Leaf reports cache
ru: Кэш листовых отчетов

source: Safe marks cache
ru: Кэш оценок доказательств корректности

source: Unsafe marks cache
ru: Кэш оценок предупреждений об ошибках

source: Unknown marks cache
ru: Кэш оценок проблем в компонентах

source: Verdicts cache
ru: Кэш вердиктов

source: Resources cache
ru: Кэш ресурсов

source: All caches
ru: Все кэши

source: Please select jobs to recalculate caches for them
ru: Пожалуйста, отметьте задания, для которых Вы хотите пересчитать кэши

source: The component was not found
ru: Компонент не был найден

source: The component is used and can't be deleted
ru: Компонент используется и не может быть удален

source: The component was successfully deleted
ru: Компонент был успешно удален

source: The component name should be greater than 0 and less than 16 symbols
ru: Название компонента должно быть больше 0 и меньше 16 символов

source: The specified component name is used already
ru: Указанное название компонента уже используется

source: The component was successfully renamed
ru: Компонент был успешно переименован

source: All unused components were deleted, please reload the page
ru: Все неиспользуемые компоненты были удалены, пожалуйста, обновите страницу

source: The problem is used and can't be deleted
ru: Проблема используется и не может быть удалена

source: The problem was successfully deleted
ru: Проблема была успешно удалена

source: All unused problems were deleted, please reload the page
ru: Все неиспользуемые проблемы были удалены, пожалуйста, обновите страницу

source: All unused files and DB rows were deleted
ru: Все неиспользуемые файлы и строки БД были удалены

source: Caches were successfully recalculated
ru: Кэши были успешно пересчитаны

source: Confirmation
ru: Подтверждение

source: Email
ru: Адрес электронной почты

source: New password
ru: Новый пароль

source: Passwords don't match
ru: Пароли не совпадают

source: The number of significant figures
ru: Количество значащих цифр

source: First name
ru: Имя

source: Language
ru: Язык

source: Data format
ru: Формат данных

source: Error trace assumptions
ru: Предположения трасс ошибок

source: New job was created
ru: Создано новое задание

source: Job was changed
ru: Задание было изменено

source: Job was deleted
ru: Задание было удалено

source: Job decision has started
ru: Началось решение задания

source: Job decision has finished
ru: Решение задания завершилось

source: New unsafe was found
ru: Обнаружено новое предупреждение об ошибке

source: New unknown was found
ru: Обнаружена новая проблема в компоненте

source: Mark was associated with leaf report
ru: Оценка были привязана к листовому отчету

source: New mark was created
ru: Создана новая оценка

source: Mark was changed
ru: Оценка была изменена

source: Mark was deleted
ru: Оценка была удалена

source: The job <a href="%(url)s">%(id)s</a> was created by %(user)s
ru: Пользователь %(user)s создал задание <a href="%(url)s">%(id)s</a>

source: The job with identifier %(id)s was created by %(user)s
ru: Пользователь %(user)s создал задание с идентификатором %(id)s

source: The job <a href="%(url)s">%(id)s</a> was changed by %(user)s: %(comm)s
ru: Пользователь %(user)s изменил задание <a href="%(url)s">%(id)s</a>: %(comm)s

source: The job with identifier %(id)s was changed by %(user)s: %(comm)s
ru: Пользователь %(user)s изменил задание с идентификатором %(id)s: %(comm)s

source: The job with identifier %(id)s was deleted by %(user)s
ru: Пользователь %(user)s удалил задание с идентификатором %(id)s

source: Started decision of the job with identifier %(id)s
ru: Началось решение заданиея с идентификатором %(id)s

source: Finished decision of the job with identifier %(id)s
ru: Завершилось решение заданиея с идентификатором %(id)s

source: Found the new unsafe for the job with identifier %(id)s
ru: Обнаружено новое предупреждение об ошибке для задания с идентификатором %(id)s

source: Found the new unknown for the job with identifier %(id)s
ru: Обнаружена новая проблема в компоненте для задания с идентификатором %(id)s

source: Jobs creation
ru: Создание заданий

source: Changes of jobs
ru: Изменения заданий

source: Jobs deletion
ru: Удаление заданий

source: Start of job decisions
ru: Начало решения заданий

source: Finish of job decisions
ru: Завершение решения заданий

source: New unsafes
ru: Новые предупрждения об ошибках

source: New unknowns
ru: Новые проблемы в компонентах

source: Changes in correlation between marks and leaf reports
ru: Изменения в привязке оценок к листовым отчетам

source: Marks creation
ru: Создание оценок

source: Changes of marks
ru: Изменения оценок

source: Marks deletion
ru: Удаление оценок

source: I am
ru: Я

source: Notify about my changes
ru: Уведомлять о моих изменениях

source: This setting is used just for the human-readable data format
ru: Данная настройка используется только для удобочитаемого формата данных

source: Time zone
ru: Часовой пояс

source: This setting turns on visualization of error trace assumptions. This can take very much time for big error traces.
ru: Данная настройка включает визуализацию предположений трасс ошибок. Это может потребовать очень много времени для больших трасс ошибок.

source: VerifierCloud Credentials
ru: Идентификационная информация для VerifierCloud

source: Notifications
ru: Уведомления

source: Registration
ru: Регистрация

source: This field is required
ru: Обязательное поле

source: The VerifierCloud credentials will be deleted
ru: Идентификационная информация для VerifierCloud будет удалена

source: Profile
ru: Учетная запись

source: Administrator
ru: Администратор

source: Role
ru: Роль

source: Last Activity
ru: Последние действия

source: Action Kind
ru: Вид действия

source: Object Type
ru: Тип объекта

source: Object Link
ru: Ссылка на объект

source: Change Comment
ru: Комментарий к изменению

source: Account has been disabled
ru: Учетная запись заблокирована

source: Incorrect username or password
ru: Неправильное имя пользователя или пароль

source: Creation
ru: Создание

source: Modification
ru: Изменение

source: Saved
ru: Сохранено

source: Continuous Verification web-interface
ru: Инструментарий для ведения непрерывной верификации

source: Copy
ru: Дублировать

source: Statistics of
ru: Статистика по

source: Instances
ru: Число запусков

source: CPU time
ru: Процессорное время

source: Memory
ru: Память

source: Wall time
ru: Астрономическое время

source: Actions with selected jobs
ru: Групповые действия с отчетами

source: Download with children
ru: Сохранить поддерево отчетов

source: Web-interface for Continuous Verification system
ru: Web-интерфейс инструментария для ведения непрерывной верификации

source: Report is empty
ru: Пустой отчет

source: RAM
ru: Память

source: Back to the reports tree
ru: Вернуться к дереву отчетов

source: components tree
ru: дерево компонентов

source: min
ru: мин

source: Back to report
ru: Вернуться к отчету

source: Back to error trace
ru: Вернуться к трассе ошибки

source: List of all error traces
ru: Список всех трасс ошибок

source: List of unmarked error traces
ru: Список неразмеченных трасс ошибок

source: Rule specification
ru: Правило

source: Applied marks
ru: Примененные оценки

source: Create default mark
ru: Создать обычную оценку

source: Create extended mark
ru: Создать расширенную оценку

source: choose required tag from
ru: необходимо выбрать из

source: unsafe tags tree
ru: дерева тегов для предупреждений об ошибке

source: safe tags tree
ru: дерева тегов для доказательств корректности

source: Create tag
ru: Создать тег

source: Users can modify
ru: Пользователи, которые могут изменять тег

source: Users can create children
ru: Пользователи, которые могут создавать теги-потомки для данного

source: Create new root tag
ru: Создать новый корневой тег

source: Download tags
ru: Сохранить теги

source: Upload tags
ru: Загрузить теги

source: Upload jobs tree
ru: Загрузить дерево отчетов

source: Selected marks
ru: Групповые действия с оценками

source: Create child
ru: Создать потомка

source: Show mark
ru: Перейти к оценке

source: No changes with total expert evaluations or the view has filtered all results
ru: Изменений в применимости оценки к трассам ошибок нет

source: The list of associated reports is empty
ru: Список отчетов, к которым была применена оценка, пуст

source: Manually resolve
ru: Разрешить противоречие

source: There are no applied marks
ru: Примененных оценок нет

source: Confirm
ru: Подтвердить применение

source: Unconfirm
ru: Отменить применение

source: Automatic
ru: Применена автоматически

source: Confirmed
ru: Подтверждена вручную

source: Unconfirmed
ru: Отменена вручную

source: Full screen mode
ru: Полноэкранный режим

source: Converted error trace
ru: Трасса ошибки после применения функции преобразования

source: Functions call tree, in which each leaf is a model function. Model function is a function, which contains property checks. This conversion function is used by default.
ru: Дерево вызовов функций, в котором каждый лист является модельной функцией. Модельной называется такая функция, которая содержит проверку требования. Данная функция преобразования используется по умолчанию.

source: Functions call tree. This conversion function is more accurate, than model functions.
ru: Дерево вызовов функций. Данная функция преобразования более точная, чем функция model functions.

source: Error trace conditions. Usually this conversion function is more accurate, than call tree.
ru: Условия трассы ошибок. Обычно данная функция преобразования более точная, чем функция call tree.

source: Error trace assignments. Usually this conversion function is more accurate, than call tree.
ru: Присваивания трассы ошибок. Обычно данная функция преобразования более точная, чем функция call tree.

source: Description of property checks (both passed and violated). The accuracy of this conversion function depends on corresponding descriptions.
ru: Описания проверок требований (как прошедшие проверку, так и нарушенные). Точность данной функции преобразования зависит от данных описаний.

source: Full error trace. This is the most accurate conversion function.
ru: Вся трасса ошибки. Данная функция преобразования является самой точной.

source: Edited error trace and compared error trace is exactly the same sequence of elements. This conversion function is used by default.
ru: Редактированная трасса ошибки полностью совпадает со сравниваемой трассой ошибки как последовательность элементов. Данная функция сравнения используется по умолчанию.

source: Edited error trace is included in compared error trace as a whole sequence.
ru: Редактированная трасса ошибки включается в сравниваемую трассу ошибки в виде подпоследовательности.

source: Edited error trace is included in compared error trace as a whole sequence with error location (compared error trace ends with edited error trace).
ru: Редактированная трасса ошибки включается в сравниваемую трассу ошибки в виде подпоследовательности с учетом метки ошибки (сравниваемая трасса ошибки заканчивается редактированной трассой ошибки).

source: All elements of the edited error trace are included into compared error trace.
ru: Все элементы редактированной трассы ошибки включаются в сравниваемую трассу ошибки.

source: All elements of the edited error trace are included into compared error trace in the same order.
ru: Все элементы редактированной трассы ошибки включаются в сравниваемую трассу ошибки в том же порядке.

source: Skip error traces comparison (therefore mark will be applied based on attributes comparison only).
ru: Не выполнять сравнение трасс (таким образом, оценка будет применяться только на основе сравнения значений атрибутов).

source: Similarity threshold
ru: Порог похожести

source: Details
ru: Подробнее

source: Show list
ru: Показать список

source: Show tags
ru: Показать теги

source: Show problems
ru: Показать проблемы

source: Show/Hide
ru: Показать/спрятать

source: Without tags
ru: Без тегов

source: element
ru: элемент

source: elements
ru: элемента(-ов)

source: There is no proof description for this safe
ru: Доказательства корректности нет

source: Regular expression
ru: Регулярное выражение

source: Control
ru: Управление

source: Choose existed tags
ru: Выбрать существующий тег

source: Create new tag
ru: Создать новый тег

source: in percents
ru: в процентах

source: Jaccard index of threads sets
ru: Мера Жаккара для множеств потоков

source: Parent components
ru: Компоненты-родители

source: Conversion function arguments
ru: Параметры функции преобразования

source: Input additional model function names separated by comma and press Enter
ru: Введите имена дополнительных модельных функций и введите Enter

source: Arguments
ru: Параметры

source: Change initial error trace for this mark
ru: Изменить исходную трассу ошибки для оценки

source: Apply only to current report
ru: Применять к трассам только из анализируемого отчета

source: List of all safes
ru: Список всех доказательств корректности

source: List of all unknowns
ru: Список всех проблем в компонентах

source: Apply
ru: Применить

source: Progress of mark application
ru: Прогресс применения оценки

source: Mark identifier
ru: Идентификатор оценки

source: Wall time of mark application
ru: Астрономическое время применения оценки

source: Number of successful applications
ru: Число успешных применений

source: Optimizations
ru: Оптимизации

source: use carefully
ru: используйте осторожно

source: Do not recalculate mark application cache
ru: Не пересчитывать кэш применения оценки

source: Optimizations for all marks were resolved
ru: Оптимизации для всех оценок были отменены

source: Download all marks
ru: Сохранить все оценки

source: Upload all marks
ru: Загрузить оценки на сервер

source: Resolve optimizations for all marks
ru: Отменить оптимизации для всех оценок

source: Delete all marks before upload
ru: Удалить все старые оценки перед загрузкой

source: Cache of instances of components
ru: Кэш компонентов

source: Remove call log that is older than 30 days
ru: Удалить внутренние логи, созданные более 30 дней назад

source: Unsafe-incomplete
ru: Предупреждения об ошибках (потенциально не все)

source: Unsafe-incompletes
ru: Предупреждения об ошибках (потенциально не все)

source: Compare by attributes
ru: Сравнивать по атрибутам

source: Select attributes values
ru: Ограничить значения атрибутов

source: Show the same transitions
ru: Показать переходы для вердиктов одного типа

source: Show reports without common attributes
ru: Показать отчеты без общих атрибутов

source: Error trace clustering
ru: Кластеризация трасс ошибок
