Repository: vmordan/klever
Catalog: bridge/locale/*/LC_MESSAGES/django.po
Languages: ru

source: Component problem description with applied marks
ru: Описание проблем компонентов и применённые к ним оценки

source: Correctness proof with applied marks
ru: Доказательство корректности и применённые к нему оценки

source: Pages
ru: Страницы

source: List of all marks for specified result
ru: Список всех оценок для выбранного вердикта

source: Tags tree for specified result
ru: Дерево тегов для выбранного вердикта

source: All verification jobs in structured view
ru: Все верификационные задания в структурированном виде

source: Choose page from content
ru: Выберите страницу

source: This page shows tool log (either verification system component or verifier) in case of failure and applied marks. Marks are applied by regular expression to logs and attributes.
ru: Данная страница показывает лог инструмента (либо компонента системы верификации, либо верификатора) и применённые оценки. Оценки применены по регулярным выражениям к логам и атрибутам.

source: Marks control
ru: Управление оценками

source: create new mark with default attributes values
ru: создать новую оценку с базовыми атрибутами

source: create new mark with ability to test regular expressions and to change attributes values
ru: создать новую оценку с возможностью тестировать применимость регулярных выражений и менять множество атрибутов

source: edit mark description (without changing mark attributes)
ru: редактировать описание оценки (без изменения атрибутов)

source: edit mark description (including attributes)
ru: редактировать описание оценки (с возможностью менять атрибуты)

source: confirm, that this automatic mark application was correct
ru: подтвердить, что автоматическое применение оценки было верным

source: unconfirm this automatic mark application
ru: отменить автоматическое применение оценки

source: Create new mark
ru: Создать новую оценку

source: The user analyses the given log, finds the cause of the problem, creates regular expression, which should be applied to the problem cause, adds description of the problem and creates new mark. If the user intends to changes mark attributes extended mark should be created.
ru: Пользовать изучает данный лог, находит причину проблемы, создаёт регулярное выражение, которое применяется к описанию причины проблемы, добавляет описание оценки и создаёт новую оценку. Если необходимо изменить множество атрибутов, по которым оценка будет применяться, то необходимо воспользоваться созданием расширенной оценки.

source: This page shows list of all marks for specified results (%(safes_trans)s, %(unsafes_trans)s or %(unknowns_trans)s). Required mark can be found in the table by attributes values or other parameters (such as verdict, tag, status, etc.). Specified mark description contains list of all results, for which mark was applied, and option to edit or delete the mark. This page can be accessed from any page via
ru: На данной странице показаны списки всех оценок для выбранного вердикта (%(safes_trans)s, %(unsafes_trans)s или %(unknowns_trans)s). Требуемая оценка может быть найдена в таблице по значению атрибутов или другим параметрам (вердикт, статус, теги и т. д.). Страница с описанием оценки включает в себя список всех результатов верификации, к которым она была применена, а также возможность редактировать или удалить оценку. Данная страница доступна из

source: delete selected marks (if the user has permissions for this)
ru: удалить выбранные оценки (если у пользователя есть право на удаление)

source: Edit mark
ru: Редактирование оценки

source: The user finds required marks (e.g., with no results) and edits or removes them. The process of editing marks can be found on the pages %(unsafe_page)s, %(unknown_page)s and %(safe_page)s.
ru: Пользователь находит нужную оценку (например, которая не применена ни к одному результату), редактирует или удаляет её. Процесс редактирования оценок описан на страницах %(unsafe_page)s, %(unknown_page)s и %(safe_page)s.

source: This page shows correctness proof and applied marks. Note, that currently correctness proof are not given by the verifier in any readable form and thus cannot be presented. Therefore, any information about correctness proof is presented in attributes, and marks are applied only by comparing selected attributes values.
ru: Данная страница показывает доказательство корректности и применённые к нему оценки. Однако поскольку на данный момент доказательства корректности не выдаются верификатором в понятном для человека виде, то они не отображаются. Следовательно, любая информация о данном доказательстве корректности может быть помещена только в атрибуты, и применение оценки производится сопоставлением значений атрибутов.

source: Similar to the %(unknown_page)s page
ru: Аналогично странице %(unknown_page)s

source: If the given correctness proof is invalid (e.g., a real bug is missing or coverage value is suspicious), the user creates new mark (extended if compared set of attributes should be changed).
ru: Если данное доказательство корректности неверно (например, пропущена реальная ошибка или значение покрытия кода подозрительно), пользователь создаёт новую оценку (расширенную, если потребуется изменить множество сравниваемых атрибутов).

source: This page shows all tags for specified results (%(safes_trans)s or %(unsafes_trans)s) as a tree structure. Each tag is used to group similar results (e.g., to specify reason of false alarm). This page can be accessed from any page via
ru: На данной странице показаны все теги для выбранного вердикта (%(safes_trans)s или %(unsafes_trans)s) в виде дерева. Каждый тег должен некоторым образом объединять похожие результаты (например, для указания причины ложного сообщения об ошибке). Страница доступна из

source: create new root element in the tags tree
ru: создать новый корневой элемент в дереве тегов

source: Tags tree element control
ru: Управление элементами дерева тегов

source: remove tags tree element
ru: удалить элемент дерева тегов

source: edit the given element
ru: редактировать выбранный элемент

source: create new child tag for the given element
ru: создать новый тег, являющийся потомком для выбранного элемента

source: The user creates new tag either as a children of existing tag or as a root element. After that the tag will be available on creating or editing marks.
ru: Пользователь создаёт новый тег в качестве либо потомка одного из существующих тегов, либо корневого элемента дерева. После этого тег будет доступен при создании или редактировании оценок.

source: show mark description with all unknown results, for which this mark was applied, with ability to edit or delete it
ru: показать описание оценки со всеми проблемами в компонентах, к которым данная оценка была применена, с возможностью редактирования и удаления

source: Each result %(unsafe_trans)s contains an error trace, which is a path in a program from the entry point to the checked property violation. This page displays representation of the error trace for the given result %(unsafe_trans)s in human-readable form. The main purpose of this page is to allow to the user to analyse this error trace to understand the reason of this violation.
ru: Каждый результат вида %(unsafe_trans)s содержит трассу ошибки – путь в программе из точки входа до нарушения проверяемого требования. Данная страница показывает представление трассы ошибки в удобном для анализа виде. Главная цель страницы – предоставить возможность пользователю проанализировать трассу ошибки для того, чтобы понять причину нарушения проверяемого требования.

source: Error trace views
ru: Представления трассы ошибки

source: show/hide all function bodies from call stack
ru: показать/спрятать операторы функций из стека при достижении метки ошибки

source: show/hide all functions bodies
ru: показать/спрятать операторы всех функций

source: show/hide code lines, which are replaced by properties checks descriptions
ru: показать/спрятать строки кода, которые замещены описаниями проверок требований

source: show/hide hidden properties checks descriptions, which are located outside function call stack
ru: показать/спрятать скрытые описания проверок требований, которые находятся вне стека функций при достижении метки ошибки

source: Error trace control
ru: Управление трассой ошибки

source: switch to full-screen mode (error trace without applied marks)
ru: перейти в полноэкранный режим (будет показана только трасса ошибки без применённых оценок)

source: download archive with error trace in html view (as presented on this page) for standalone usage
ru: скачать архив с трассой ошибки (аналогично представлению на данной странице) для использования в автономном режиме

source: download internal representation of error trace (json format)
ru: скачать внутреннее представление трассы ошибки (в формате json)

source: upload internal representation of error trace (json format), which will be presented instead of original error trace
ru: загрузить на сервер внутреннее представление трассы ошибки (в формате json), которое далее будет представлено вместо отображаемой трассы

source: edit error trace on the page %(error_trace_edit_page)s (change representation of error trace)
ru: редактировать трассу ошибки на странице %(error_trace_edit_page)s (т. е. измененить текущее представление трассы ошибки)

source: create new mark with default settings
ru: создать новую оценку с базовыми настройками

source: create new mark with adjusted settings on the page %(unsafe_mark_page)s (note, this is for advanced users only)
ru: создать новую оценку с изменёнными настройками на странице %(unsafe_mark_page)s (для продвинутых пользователей)

source: show mark description with all error traces, for which the mark was applied, with ability to edit (on the %(unsafe_mark_page)s page) or removed it
ru: показать описание оценки со всеми трассами ошибок, к которым она была успешно применена, и возможностью редактирования (см. страницу %(unsafe_mark_page)s) и удаления

source: edit mark description, which does not affect its application
ru: редактировать описание оценки (не влияет на применимость оценки)

source: fully edit mark on the %(unsafe_mark_page)s page, which may change its application
ru: редактировать настройки оценки, которые влияют на её применимость (см. страницу %(unsafe_mark_page)s)

source: create new tag, which will be used for this mark (see page %(tags_page)s)
ru: создать новый тег, который будет использован для данной оценки (см. страницу %(tags_page)s)

source: Some actions requires corresponding permissions for the user
ru: Некоторые действия требуют наличия соответствующих прав у пользователя

source: The user analyses this error trace and determines, whether it corresponds to real bug or to false alarm. Then the user chooses action "Create default mark", specifies verdict (bug/false alarm/unknown), current status and description, chooses tags to group this error trace (see page %(tags_page)s) and presses "Save". After that a table will be shown with all error traces from current report, for which created mark was successfully applied. The user should check each trace in order to understand, whether this application was correct or not (ideally, one and only one mark should be applied to each error trace). If at least one application is incorrect, then the user should use some way for extended mark creation.
ru: Пользователь анализирует трассу ошибки и определяет, соответствует ли она реальной ошибке в коде программы или нет. Далее пользователь выбирает действие "Создать обычную оценку", указывает вердикт (ошибка, ложное сообщение об ошибке или неизвестно), текущий статус и описание, выбирает теги (см. страницу %(tags_page)s) и нажимает "Сохранить". После этого будет представлена таблица со всеми трассами ошибок из анализируемого отчёта, для которых оценка была успешно применена. Пользователь обязан проверить каждую трассу для того, чтобы определить, корректно или нет данное применение оценки (в идеале одна и только одна оценка должна быть применена для каждой трассы). Если хотя бы одно применение неверно, необходимо использовать более сложные способы создания оценки.

source: Create mark by edited trace
ru: Создать оценку по редактированной трассе ошибки

source: The user could not create required default mark and there is a suggestion, which element should be added to the trace or removed from the trace, so its mark would satisfy the users needs. The user removes previously created mark, edits the error trace (see page %(error_trace_edit_page)s) by adding or removing required elements, then creates a new default mark with selected option "Use edited error trace". If the new mark still does not meet the user requirements, the user should create extended mark.
ru: Пользователь не смог создать требуемую обычную оценку и после небольшого анализа предположил, какой элемент должен быть либо добавлен в трассу, либо удалён из неё, чтобы оценка удовлетворяла требованиям. Пользователь удаляет обычную оценку, редактирует трассу ошибки (см. страницу %(error_trace_edit_page)s) путём добавления или удаления нужных элементов, затем создаёт новую обычную оценку, при этом выбирая опцию "Использовать отредактированную трассу ошибки". Если новая оценка все равно не удовлетворяет требованиям пользователя, необходимо создать расширенную оценку.

source: Create or edit extended mark (advanced users only)
ru: Создать или редактировать расширенную оценку (для продвинутых пользователей)

source: The user chooses action "Create extended mark" or "Edit" for already created mark and then iteratively adjusts settings until this mark meets the requirements according to instructions (see page %(unsafe_mark_page)s)
ru: Пользователь выбирает действие "Создать расширенную оценку" или "Редактировать" для уже созданной оценки и итеративно настраивает параметры оценки, пока она полностью не удовлетворит требованиям пользователя в соответствии с инструкцией (см. страницу %(unsafe_mark_page)s)

source: Adjust mark description
ru: Изменить описание оценки

source: The user intends to adjust mark without changing its application, chooses action "Adjust mark description" and changes mark verdict, status, tags or description.
ru: Если требуется скорректировать оценку без изменения её применимости, пользователь выбирает действие "Изменить описание" и меняет вердикт оценки, статус, теги или описание.

source: Resolve a problem with incompatible marks
ru: Разрешить проблему несовместимых оценок

source: If several marks were applied to some error trace, then at least one of them is incorrect. The user should either edit marks, until only one of them is applied to the given error trace (see third use case) or (as a temporary solution) manually "unconfirm" some marks. This will not affect other error traces, which are marked incorrectly, but will remove "Incompatible marks" verdict for this error trace.
ru: Если несколько оценок применены к одной и той же трассе, то как минимум одна из них является некорректной. Пользователь либо редактирует оценки до тех пор, пока только одна из них не будет успешно применяться к трассе (см. третий сценарий), либо (в качестве временного решения) вручную отменяет применение некоторых оценок. Подобное решение не затронет другие трассы ошибок, к которым также некорректно были применены данные оценки, однако удалит вердикт "Несовместимые оценки" для данной трассы ошибки.

source: Save error trace for standalone usage
ru: Сохранить трассу ошибки для автономного использования

source: If current error trace should be demonstrated outside of this web-interface, the user chooses action "Download standalone trace". Resulting archive contains html version of error trace with required resources.
ru: Если трасса ошибки должны быть представлена за рамками данного web-интерфейса, то пользователь выбирает действие "Сохранить трассу в автономном режиме". Полученный архив будет содержать трассу ошибки в виде html с требуемыми ресурсами.

source: Edit error trace
ru: Редактировать трассу ошибки

source: In order to improve error trace visualization, the user can change, add or remove displayed messages on the error trace by choosing action "Edit". Also edited error trace can be used in a standalone mode or for more accurate mark creation. The user can save changes of the error trace with help of action "Download error trace internal representation" (in internal representation), which can be uploaded later to display instead of this or other error trace with help of action "Upload edited error trace".
ru: Для того чтобы улучшить визуализацию трассы ошибки пользователь может изменить, добавить или удалить отображаемые сообщения в трассе с помощью действия "Редактировать". Помимо этого, отредактированная трасса ошибки может быть использована в автономном режиме или для создания более точной оценки. Пользователь может сохранить изменения в трассе посредством действия "Сохранить внутреннее представление трассы", которое в дальнейшем может быть загружено для отображения вместо данной или любой другой трассы ошибки действием "Загрузить отредактированную трассу ошибки".

source: This page allows to adjust settings for unsafe mark in order to meet the user requirements. Usually this page should be used, if unsafe mark with default settings does not meet the requirements, i.e. either it is applied to traces, which correspond to other bugs, or there are trace, which correspond to the same bug, but the mark was not applied to them.
ru: Данная страница позволяет изменить настройки оценки для трассы ошибки, чтобы она стала удовлетворять требованиям пользователя. Обычно данная страница используется, если оценка с базовыми настройками не удовлетворяет данным требованиям, т. е. либо она применяется к трассам, которые соответствуют разным ошибкам, либо не применяется ко всем трассам, которые соответствуют одной и той же ошибке.

source: Internal representation of an error trace is a sequence of elements, each element contains the following data:
ru: Во внутреннем представлении трасса ошибки – это последовательность элементов, каждый из которых содержит следующие данные:

source: type (function call, assignment, assumption, etc.)
ru: тип (вызов функции, присваивание, проверка условия и т. д.)

source: link to the source code (file name, line number)
ru: ссылка на исходный код (имя файла, номер строки)

source: thread identifier (for multi-threaded error traces)
ru: идентификатор потока (для многопоточных трасс ошибок)

source: (optional) property checks descriptions (both passed and violated)
ru: (опционально) описание проверок требований (как успешно прошедшие, так и нарушенные)

source: Error traces are called <b>equivalent</b> if they correspond to the same bug (or to the same reason of false alarm). In order to compare error trace under analysis %(t1)s with some other error trace %(t2)s the <code>is_equivalent(%(t1)s, %(t2)s)</code> function is suggested:
ru: Трассы ошибок называются <b>эквивалентными</b>, если они соответствуют одной и той же ошибке в программе (или одной и той же причине ложного сообщения об ошибке). Для того чтобы сравнивать анализируемую трассу ошибки %(t1)s с некоторой другой трассой %(t2)s предлагается функция <code>is_equivalent(%(t1)s, %(t2)s)</code>:

source: In case of one-threaded error trace this function is simplified into:
ru: Если трасса ошибки состоит из одного потока, то данная функция упрощается:

source: Conversion function <code>conversion(t, args)</code> removes nonessential error trace elements, <code>args</code> are optional parameters. Comparison function <code>comparison(t<sub>1</sub>, t<sub>2</sub>)</code> determines, how two error traces are compared (as sequences). If an error trace consists of multiple threads, then it returns the number of equivalent threads. Function <code>manual(t)</code> corresponds to the user changes in an error trace (e.g., the user may remove some elements in addition to conversion function). In case of multi-threaded error trace, function <code>similarity(n)</code> evaluates similarity of 2 error traces based on the number of equivalent threads, which should be greater or equal to the given <code>similarity_threshold</code> value in order to consider traces to be equivalent. Therefore, unsafe mark is determined by the following parameters <code>conversion, args, comparison, similarity, similarity_threshold</code>.<br> Note, that traces are considered to be equivalent with respect to the given parameters. If they are meaningless, this comparison means nothing.
ru: Функция преобразования <code>conversion(t, args)</code> удаляет несущественные элементы трассы, <code>args</code> – необязательные параметры. Функция сравнения <code>comparison(t<sub>1</sub>, t<sub>2</sub>)</code> определяет, как две трассы должны сравниваться (в виде последовательности). Если трассы ошибки многопоточные, то функция сравнения возвращает число совпавших потоков. Функция <code>manual(t)</code> отражает пользовательские изменения трассы (например, пользователь может удалить некоторые элементы трассы после применения функции преобразования). В случе многопоточных трасс ошибок функция <code>similarity(n)</code> оценивает похожесть двух трасс на основе числа совпавших потоков. Для того чтобы трассы были признаны эквивалентными, полученное значение похожести должно превышать заданное пороговое значение <code>similarity_threshold</code>. Таким образом, оценка трассы ошибки определяется следующими параметрами: <code>conversion, args, comparison, similarity, similarity_threshold</code>.<br>Стоит отметить, что эквивалентность трасс определяется с точностью до заданных параметров. Если параметры заданы некорректно, то реальная эквивалентность или её отсутствие не гарантируется.

source: Parameters
ru: Параметры

source: Default mark creation parameters (verdict, status, tags, description). They do not affect mark application.
ru: Параметры, характерные для создания обычной оценки (вердикт, статус, теги, описание). Не влияют на применимость оценки.

source: this error trace will be compared with other traces, which have the same selected attributes with the same values. In order to use some attribute for comparison first select it, then choose required comparison operator and input attribute value. In case of comparison for equality, inequality or by regular expression (RE) you can input several values, separated by commas. In case of numeric comparison operators both user value and all values for that attribute should be numbers.
ru: трасса ошибки будет сравниваться с трассами, для которых выбранные атрибуты имеют указанные значения. Для того чтобы использовать некоторый атрибут для сравнения, необходимо его отметить, затем выбрать оператор, в соответствии с которым его значения будут сравниваться со значениями других подобных атрибутов, и ввести значение для сравнения. Если выбрано сравнение на равенство, неравенство или по регулярному выражению (RE), то можно ввести несколько значений через запятую. Если выбрано сравнение чисел, то как введённое пользователем значение, так и все значения данного атрибута должны быть числами.

source: allows to choose function <code>conversion(t)</code> from the predefined list. Each function comes with description. By default function <code>model functions</code> is used (model function is a function, which contains property check).
ru: позволяет выбрать функцию <code>conversion(t)</code> из предопределённого списка. Для каждой функции дано описание. По умолчанию используется функция <code>model functions</code> (модельной называется функция, которая содержит проверки требования).

source: allows to specify additional parameters <code>args</code>
ru: позволяет задать параметры <code>args</code>

source: remove specified function calls from error trace (function names should be separated by commas)
ru: удалить указанные функции из трассы ошибки (имена функций должны быть указаны через запятую)
