Repository: vmordan/klever
Catalog: bridge/locale/*/LC_MESSAGES/django.po
Languages: ru

source: Apply automatic clustering of error traces without marks
ru: Автоматически кластеризовать трассы ошибок без оценок

source: Warning
ru: Внимание

source: this operation *will* require a lot of time
ru: данная операция занимает *много* времени

source: Failures before verifier
ru: Падения до запуска верификации

source: no common attributes
ru: без общих атрибутов

source: compared elements by attributes
ru: сравниваемых элементов с общими атрибутами

source: Full launch CPU time
ru: Процессорное время всего запуска

source: Full launch wall time
ru: Астрономичесок время всего запуска

source: Full launch memory usage
ru: Оперативная память, использованная на весь запуск

source: error traces
ru: трасс ошибок

source: Error traces
ru: Трассы ошибок

source: clusters
ru: кластеров

source: lost
ru: потеряно

source: new
ru: найдено новых

source: common
ru: общие

source: Statistics
ru: Статистика

source: Automatic marks application
ru: Автоматически примененные оценки - АПО

source: Auto
ru: АПО

source: launches
ru: запусков

source: Origin
ru: Источник

source: trace
ru: трасса

source: Show results for
ru: Показать результат для

source: Different clusters
ru: Различных кластеров

source: Clusters with different number of error traces
ru: Кластеров с разным числом трасс ошибок

source: All clusters
ru: Всех кластеров

source: Error trace clusters
ru: Кластеры трасс ошибок

source: speedup
ru: ускорение

source: Missing results due to different attributes
ru: Потерянные результаты из-за несоответствия атрибутов

source: Additional model functions
ru: Дополнительные модельные функции

source: Filtered functions
ru: Функции для фильтрации

source: Add property checks description
ru: Добавить описания проверок требований

source: Add error label description
ru: Добавить описания меток ошибок

source: Do not consider property checks description
ru: Не учитывать описания проверок требований

source: add only location of property checks (without description)
ru: добавить только места проверок требований (без описаний)

source: Logs were successfully cleared
ru: Логи успешно очищены

source: unused converted error traces of
ru: неиспользуемых преобразованных трасс ошибок из

source: have been deleted
ru: было удалено

source: converted error traces have been deleted
ru: преобразованных трасс ошибок было удалено

source: Job attributes view cache is empty
ru: Кэш отображения атрибутов отчетов пуст

source: cached records were successfully deleted
ru: записей кэша было удалено

source: Actions with marks
ru: Действия с оценками

source: Safe DB cleaning
ru: Безопасная очистка БД

source: Unsafe DB cleaning (do *not* use!)
ru: Небезопасная очистка БД (*не* использовать!)

source: Remove unused converted error traces
ru: Удалить неиспользуемые преобразованные трассы ошибок

source: Clear all converted error traces
ru: Удалить все преобразованные трассы ошибок

source: Clear job attributes views
ru: Удалить отображения атрибутов оценок

source: Adjust description
ru: Изменить описание

source: Different attributes
ru: Различающиеся атрибуты

source: Common attributes
ru: Общие атрибуты

source: Show different attributes
ru: Показать различающиеся атрибуты

source: overall speedup
ru: общее ускорение

source: average speedup
ru: среднее ускорение

source: Actions with tags
ru: Действия с тэгами

source: Show unsafe marks
ru: Показать оценки предупреждений об ошибках

source: Show safe marks
ru: Показать оценки доказательств корректности

source: Show unknown marks
ru: Показать оценки проблем в компонентах

source: Show unsafe tags tree
ru: Показать дерево тегов предупреждений об ошибке

source: Show safe tags tree
ru: Показать дерево тегов доказательств корректности

source: Download unsafe tags
ru: Сохранить теги предупреждений об ошибке

source: Download safe tags
ru: Сохранить теги доказательств корректности

source: Upload unsafe tags
ru: Загрузить теги предупреждений об ошибке

source: Upload safe tags
ru: Загрузить теги доказательств корректности

source: Recalculate caches
ru: Пересчитать кэши

source: Verification launches
ru: Запуски инструмента верификации

source: Share
ru: Поделиться

source: Hide
ru: Скрыть

source: Show default
ru: Отменить

source: Verifiers
ru: Верификатор

source: Show _MENU_ rows
ru: Показывать _MENU_ строк

source: Display from _START_ to _END_ of _TOTAL_ rows
ru: Показано от _START_ до _END_ из _TOTAL_ строк

source: Nothing is found
ru: Ничего не найдено

source: filtered of _MAX_ rows
ru: отфильровано из _MAX_ строк

source: Next
ru: Следующая

source: Previous
ru: Предыдущая

source: all
ru: все

source: shared
ru: общий

source: One of the selected jobs wasn't found or wasn't decided
ru: Один из заданных отчетов пуст

source: Association change kind
ru: Результат применения

source: Error trace edit
ru: Редактирование трассы ошибки

source: Modify error trace element
ru: Модификация элемента трассы

source: Property check description
ru: Описание проверки требования

source: Error label description
ru: Описание метки ошибки

source: Toggle functions from call stack
ru: Отобразить/скрыть функции из стека на метке ошибки

source: Toggle all functions
ru: Отобразить/скрыть все функции

source: Toggle notes code
ru: Отобразить/скрыть код проверок

source: Toggle hidden notes
ru: Отобразить/скрыть проверки, находящиеся вне стека функций на метке ошибки

source: Remove edited error trace
ru: Удалить отредактированную трассу ошибки

source: Attention: all changes will be lost!
ru: Внимание: все изменения будут потеряны!

source: Association type
ru: Тип применения оценки

source: Use edited error trace
ru: Использовать отредактированную трассу ошибки

source: Required object does not exist
ru: Требуемый объект не существует

source: Upload edited error trace
ru: Загрузить отредактированную трассу ошибки

source: Cannot parse edited error trace
ru: Не распознан формат отредактированной трассы ошибки

source: Common components problems comparison
ru: Сравнение общих проблем в компонентах

source: Show common components problems comparison
ru: Показать сравнение общих проблем в компонентах

source: Different problems
ru: Различные проблемы

source: Different or unmarked problems
ru: Различные или неразмеченные проблемы

source: All problems
ru: Все проблемы

source: Common component problems
ru: Общие проблемы в компонентах

source: selected
ru: выбрано

source: Download error trace internal representation
ru: Сохранить внутреннее представление трассы

source: Download standalone trace
ru: Сохранить трассу в автономном режиме

source: Add reports for comparison
ru: Добавить отчеты для сравнения

source: Page
ru: Страница

source: This page presents configurable comparison of 2 verification reports by different criterias.
ru: На данной странице представлено настраиваемое сравнение двух верификационных отчётов по разным критериям.

source: Required theoretical information
ru: Требуемая теоретическая информация

source: The verification report consists of several verification tool launches, and each launch contains the following data
ru: Верификационный отчёт состоит из нескольких запусков инструмента верификации, при этом каждый запуск содержит следующие данные

source: Verification results, each result can be %(safes_trans)s, %(unsafes_trans)s, or %(unknowns_trans)s. Each launch may contain several results
ru: Результаты верификации (%(safes_trans)s, %(unsafes_trans)s или %(unknowns_trans)s). Каждый запуск может содержать несколько подобных результатов

source: Consumed resources by verification tool
ru: Потреблённые инструментом верификации ресурсы

source: Attributes, which makes this launch unique (e.g., what and where is being verified). Note, that some launch results may contain additional attributes, which make them unique in comparison with other results
ru: Атрибуты, которые позволяют выделить данный запуск (например, указывая, какое свойство и где проверяется). Стоит отметить, что некоторые результаты, относящиеся к запуску, могут иметь дополнительные атрибуты, которые обеспечивают их уникальность среди других результатов данного запуска

source: In order to compare reports we choose some "core" attributes (can be adjusted in the Settings), divide all verification results by so called compared elements with chosen attributes (each object has the same values of those attributes) and then compare such elements with the same attribute values by different criterias. Note, that compared elements may match verification launches or not.
ru: Для сравнения отчётов выбираются "ядровые" атрибуты (задаются в настройках), далее все результаты верификации разбиваются на так называемые сравниваемые элементы (каждый элемент имеет одинаковые значения выбранных атрибутов), после чего производится сравнение данных элементов по различным критериям. Стоит отметить, что сравниваемые элементы могут как совпадать с запусками инструмента, так и не совпадать.

source: Comparison criterias
ru: Критерии сравнения

source: comparison of overall information on verification launches (number of launches and compared elements)
ru: сравнение общей информации о запусках инструмента верификации (число запусков и сравниваемых элементов)

source: set of attributes values for all verification launches (values for compared elements are highlighted)
ru: множество значений атрибутов для всех запусков инструмента верификации (значения для сравниваемых элементов подсвечены)

source: components problems, which happened before verification launches and thus potentially could affect them
ru: проблемы в компонентах, произошедшие до запуска инструмента верификации и тем самым способные повлиять на запуски

source: elements, which are not compared (they are shown for each verdict type, which is specified in the Settings)
ru: элементы, которые не сравниваются (показываются для результатов каждого типа, указанного в настройках)

source: comparison of none-"core" attributes values for compared elements (for each additional attribute specified in the Settings)
ru: сравнение значений атрибутов, которые не являются "ядровыми", для сравниваемых элементов (для каждого дополнительного атрибута, заданного в настройках)

source: comparison of consumed resources (by compared elements only and by all verification launches)
ru: сравнение потреблённых ресурсов (для сравниваемых элементов отдельно и для всех запусков инструмента верификации)

source: Results transitions
ru: Переходы результатов верификации

source: the next four sections contain verification results transitions from some results type to other types. These sections require, that each compared element consist of either:
ru: следующие четыре секции содержат переходы результатов верификации для каждого вердикта. Для данных секций требуется, чтобы каждый сравниваемый элемент состоял из:

source: only one result type %(safe_trans)s (and thus the element has overall result %(safe_trans)s) or
ru: только одного результата %(safe_trans)s (при этом общий вердикт для элемента также будет %(safe_trans)s), или

source: only one result type %(unknowns_trans)s (and thus the element has overall result %(unknowns_trans)s) or
ru: только одного результата вида %(unknowns_trans)s (при этом общий вердикт для элемента также будет вида %(unknowns_trans)s), или

source: one or more results of type %(unsafe_trans)s (and thus element has overall result %(unsafe_trans)s) or
ru: одного или нескольких результатов %(unsafe_trans)s (при этом общий вердикт для элемента также будет %(unsafe_trans)s), или

source: one or more results of type %(unsafe_trans)s and one result type %(unknowns_trans)s (and thus element has overall result %(unsafe_incomplete_trans)s)
ru: одного или нескольких результатов %(unsafe_trans)s и одного результата вида %(unknowns_trans)s (при этом общий вердикт будет '%(unsafe_incomplete_trans)s')

source: Note, that transitions to the same result type (e.g., %(unsafe_trans)s->%(unsafe_trans)s) can be accessed via the Settings.
ru: Для отображения переходов в тот же вердикт (например, %(unsafe_trans)s->%(unsafe_trans)s) необходимо скорректировать настройки.

source: comparison of error traces, which are in the same compared elements (can be enabled in the Settings). First, all error traces for each compared element are divided into clusters (equivalence of two error traces is defined on the page %(unsafe_mark_page)s), then all clusters are compared for each compared element. Each cluster represents either already existed mark (see page %(marks_page)s) or automatically applied mark. New and lost clusters are highlighted
ru: сравнение трасс ошибок, которые относятся к одним и тем же сравниваемых элементам (может быть включено в настройках). Сначала все трассы ошибок для каждого сравниваемого элемента разбиваются на кластеры (эквивалентность двух трасс ошибок определяется на странице %(unsafe_mark_page)s), затем сравниваются полученные кластеры для каждого сравниваемого элемента. Каждый кластер представляют собой либо существующую оценку (см. страницу %(marks_page)s), либо автоматически применённую оценку. Новые и потерянные кластеры подсвечены

source: comparison of common %(unknowns_trans)s results. 2 elements with result %(unknown_trans)s are considered equivalent, if they have the same set of applied marks (see page %(marks_page)s)
ru: сопоставление результатов вида %(unknowns_trans)s для сравниваемых элементов. Два элемента вида %(unknown_trans)s считаются эквивалентными, если к ним применены одни и те же оценки, (см. страницу %(marks_page)s)

source: adjustment of "core" attributes
ru: задание "ядровых" атрибутов

source: restriction of attribute values (elements with unselected values will be excluded from comparison)
ru: ограничение множества значений атрибута (элементы, для которых значения атрибутов исключены из множества, сравниваться не будут)

source: enables the same transitions in results transition section for specified results type
ru: включает переходы в тот же вердикт для заданного типа результата

source: enables section missing results due to different attributes for specified results type
ru: включает секцию с потерянными результатами для указанного типа результата

source: enables error trace clustering. Arguments for performing comparison of two error traces are defined on the page %(unsafe_mark_page)s. Argument "show results for" determines, which clusters should be displayed. Note, this option may require a lot of time for some arguments and big number of error traces
ru: включает кластеризацию трасс ошибок. Аргументы сравнениях трасс ошибок определены на странице %(unsafe_mark_page)s. Аргумент "Показать результат для" определяет, какие кластеры будут отображены. Необходимо учесть, что данная опция может потребовать много времени при определённых настройках или большом числе трасс ошибок

source: enables comparison of common %(unknowns_trans)s results and determines, which results should be displayed
ru: включает сравнение общих результатов вида %(unknowns_trans)s и определяет, какие результаты должны быть показаны

source: adds or removes reports for comparison. Note, that reports are added into some pool, from which they can be selected later. You cannot remove currently compared report
ru: добавляет или удаляет отчёты для сравнения. При этом отчёты добавляются в некий пул, откуда впоследствии могут быть выбраны. Нельзя удалить сравниваемый на данный момент отчет

source: swap compared reports
ru: поменять местами сравниваемые отчёты

source: choose report for comparison on the current position (available if more than 2 reports selected for comparison)
ru: выбрать отчёт для сравнения на данной позиции (опция доступна если в пуле находится более двух отчётов для сравнения)

source: apply settings to adjust comparison criterias
ru: применить настройки для изменения критериев сравнения

source: apply default settings for comparison criterias
ru: применить настройки по умолчанию для критериев сравнения

source: Compared reports change
ru: Замена сравниваемых отчётов

source: Settings control
ru: Управление настройками

source: The user selects required reports, adjusts comparison criterias via Settings if needed, and compares values.
ru: Пользователь выбирает требуемые отчёты для сравнения, настраивает критерии сравнения при необходимости и сопоставляет значения.

source: This page allows to edit representation of error trace (which is displayed on the %(unsafe_page)s page). By default error trace is shown as functions call stack with property checks descriptions and error location descriptions. Therefore, error trace edition includes changing, adding or removing such descriptions.
ru: Данная страница позволяет редактировать представление трассы ошибки (которое отображено на странице %(unsafe_page)s). По умолчанию трасса ошибки представлена в виде стека вызовов функций, в который добавлены описания проверок проверяемых свойств и метки ошибок (нарушений проверяемых свойств). Таким образом, редактирование трассы ошибок представляет собой изменений, добавление и удаление подобных описаний.

source: Error trace representation and its views are the same as in the %(unsafe_page)s page
ru: Отображение трассы ошибок и ее представления описаны на странице %(unsafe_page)s

source: Error trace edit control
ru: Управление редактированием трассы ошибок

source: discard any changes on this page and return to the %(unsafe_page)s page
ru: отменить изменения, выполненные на данной странице, и вернуться на страницу %(unsafe_page)s

source: apply changes to the error trace
ru: применить изменения трассы ошибок

source: discard all previous changes to the error page (original error trace will be presented after this on the %(unsafe_page)s page). WARNING: all changes to this error trace will be lost after performing this action
ru: отменить все ранее применённые изменения трассы ошибок (т. е. на странице %(unsafe_page)s будет показана оригинальная трасса ошибок). ВНИМАНИЕ: все изменения трассы ошибок будут потеряны после выполнения данного действия

source: Error trace element edit
ru: Редактирование элемента трассы ошибок

source: remove corresponding note or warning
ru: удалить соответствующие описание проверки проверяемого свойства или метки ошибки

source: Change visual representation of error trace
ru: Изменить визуальное отображение трассы ошибки

source: In order to remove note or warning use 'remove' action on corresponding line. In order to add new note or warning or edit existing right click on corresponding line number, input any text and press OK. After all changes are done, use action
ru: Для того чтобы удалить описание проверяемого свойства или метки ошибки необходимо использовать действие 'удалить' на соответствующие строке. Для того чтобы добавить новое или отредактировать существующее описание проверяемого свойства или метки ошибки необходимо использовать нажать правой кнопкой мыши на соответствующем номере строки кода, ввести текст и нажать Хорошо. После внесения всех требуемых изменений необходимо использовать действие

source: General information
ru: Общая информация

source: Actions
ru: Действия

source: Main use cases
ru: Основные сценарии работы

source: This page presents overall information about verification report and allows to the users to select specific data for further analysis
ru: Данная страница представляет общую информацию о верификационном отчёте и позволяет пользователю выбрать интересующий раздел для дальнейшего анализа

source: Presented information blocks
ru: Представленные разделы

source: Verification results
ru: Результаты верификации

source: provide access to each result type on the pages
ru: предоставляют доступ к вердиктам на страницах

source: This block includes some common filters (e.g., "False alarms" for unsafes)
ru: Данный блок включает базовые фильтры (например, "Ложные сообщения об ошибках" для Предупреждений об ошибках)

source: by the whole verification process and its components
ru: всем процессом верификации и его отдельными компонентами

source: can be used to filter results
ru: могут быть использованы для фильтрации результата

source: short description of children reports in accordance with reports hierarchy, presented on the page %(jobs_page)s (for inner tree nodes only)
ru: короткое описание отчётов-потомков в соответствии с иерархией отчётов, представленной на странице %(jobs_page)s (отображается только для внутренних узлов дерева)

source: Filter by attributes
ru: Фильтрация по атрибутам

source: apply selected attributes values to filter verification results
ru: применить выбранные атрибуты для фильтрации результатов верификации

source: cancel applied before attributes filter
ru: отменить ранее применённую фильтрацию по атрибутам

source: Mark all error traces
ru: Разметка трасс ошибок

source: The user filters results by required attributes (by default no filter is applied), analyses each unsafe result from the given list in order to determine, whether it corresponds to a real bug in a program or to false alarm (see page %(unsafe_page)s)
ru: Пользователь фильтрует результат по нужным атрибутам (по умолчанию фильтрация не применена), затем анализирует каждое предупреждение об ошибке чтобы определить, соответствует ли оно реальной ошибке в коде программы или нет (см. страницу %(unsafe_page)s)

source: see page
ru: см. страницу

source: Mark all component failures
ru: Разметка проблем в компонентах

source: The user analyses each unknown result from the given list in order to determine the cause of the problem
ru: Пользователь анализирует каждую проблему в компонентах для определения ее причины

source: This page presents all verification jobs as a tree. Inner tree nodes form hierarchical structure, whereas leaf nodes contain reports on solved verification jobs. Detailed description of reports is presented on the page %(job_page)s. This page can be accessed from any page via
ru: На данной странице представлены все верификационные задания в виде дерева. Внутренние узлы дерева формируют иерархическую структуру, в то время как листья содержат отчёты о решённых заданиях. Подробное описание отчётов находится на странице %(job_page)s. Для перехода на данную страницу выберите

source: %(group_actions_trans)s -> %(compare_reports_trans)s - compares several solved verification jobs (leaf tree nodes). Results will be presented on the page %(comparison_page)s.
ru: %(group_actions_trans)s -> %(compare_reports_trans)s - сравнить несколько решённых верификационных заданий (листовых вершин дерева). Результаты будут представлены на странице %(comparison_page)s.

source: Analyse verification report
ru: Проанализировать верификационный отчет

source: The user finds required node by its name and continues its analysis on the page %(job_page)s.
ru: Пользователь находит нужный отчёт по названию и продолжает его анализ на странице %(job_page)s.

source: The user selects required solved verification jobs (leaf tree nodes) and chooses action %(compare_reports_trans)s. Note, that comparison cannot be performed on inner tree nodes.
ru: Пользователь выбирает требуемые решённые верификационные задания (листовые вершины дерева) и выбирает действие %(compare_reports_trans)s. Данная операция не применима к внутренним узлам дерева.

source: Help
ru: Справка

source: Content
ru: Содержание

source: Representation of error trace with applied marks
ru: Представление трассы ошибки и применённые к ней оценки

source: Form for editing representation of error trace
ru: Форма для редактирования трассы ошибки

source: Extended unsafe marks
ru: Расширенный режим редактирования оценок для трасс ошибок

source: Detailed report on solved verification job
ru: Детальный отчёт о решённом верификационном задании

source: Comparison of verification reports
ru: Сравнение верификационных отчетов
